Classes | Enumerations | Functions
Element difference generator
Functions to get the elements which differ between two projects or project states. More...
 Classes
struct  | API_ElemDifference
Common structure for the element difference generator components. More...
struct  | API_ElemDifferenceGeneratorState
Common structure for the element difference generator components. More...
 Enumerations
enum  | API_ElemDifferenceGeneratorTypeID { APIDiff_ModificationStampBased = 'MSBD' , APIDiff_3DModelBased = '3DMB' , APIDiff_ContextBased = 'CBSD' }
Determines the type of the element difference generator methode type.
enum  | API_ElemDifferenceGeneratorStateType { APIDiffState_InFile = 1 , APIDiffState_InMemory , APIDiffState_CurrentProject }
Determines the type of the element difference generator methode type.
 Functions
GSErrCode __ACENV_CALL  | ACAPI_DifferenceGenerator_GetState (API_ElemDifferenceGeneratorTypeID type, API_ElemDifferenceGeneratorState *diffGeneratorState)
Classifies an element.
GSErrCode __ACENV_CALL  | ACAPI_DifferenceGenerator_GenerateDifference (API_ElemDifferenceGeneratorTypeID type, API_ElemDifferenceGeneratorState *diffState1, API_ElemDifferenceGeneratorState *diffState2, API_ElemDifference &difference)
It gives back the differencies between two states.
Detailed Description
Functions to get the elements which differ between two projects or project states.
Function Documentation
◆ ACAPI_DifferenceGenerator_GenerateDifference()
 GSErrCode __ACENV_CALL ACAPI_DifferenceGenerator_GenerateDifference  |  ( |  API_ElemDifferenceGeneratorTypeID  |  type,
|  API_ElemDifferenceGeneratorState *  |  diffState1,
|  API_ElemDifferenceGeneratorState *  |  diffState2,
|  API_ElemDifference &  |  difference
)
It gives back the differencies between two states.
Since
Archicad 26
Parameters
type | [in] The element difference generator method type.
diffState1 | [in] The first difference generator state.
diffState2 | [in] The second difference generator state.
difference | [out] The result of the difference generator.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - The diffState1 or diffState2 is nullptr, or has wrong input parameters.
APIERR_GENERAL - There is no current plan open.
◆ ACAPI_DifferenceGenerator_GetState()
 GSErrCode __ACENV_CALL ACAPI_DifferenceGenerator_GetState  |  ( |  API_ElemDifferenceGeneratorTypeID  |  type,
|  API_ElemDifferenceGeneratorState *  |  diffGeneratorState
)
Classifies an element.
Parameters
type | [in] The element difference generator methode type.
diffGeneratorState | [in/out] The difference generator state.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - The diffGeneratorState is nullptr, or has wrong input parameters.
APIERR_GENERAL - There is no current plan open.